Revit 2026 API

# MetalPatternType Enumeration

---

The enumerated type representing the permitted values for the asset property "MetalPattern" from the "Metal" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum MetalPatternType
```
```vb
Public Enumeration MetalPatternType
```
```cpp
public enum class MetalPatternType
```
```fsharp
type MetalPatternType
```

| Member name | Value | Description |
| --- | --- | --- |
| CheckerPlate | 3 |  |
| Custom | 4 |  |
| DiamondPlate | 2 |  |
| Knurl | 1 |  |
| None | 0 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace